app/controllers/meals_controller.rb

  def index
    @meals = Meal.all
---
SELECT * FROM "meals"